IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM9_CONTROLSS_G1_EPWM9.xml
	<register id="CONTROLSS_G1_EPWM9_CMPD_SHDW3" acronym="CONTROLSS_G1_EPWM9_CMPD_SHDW3" offset="0x7BE" width="16" description="CMPD Shadow 3 Register">
		<bitfield id="CMPD_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="The value in the CMPD_SHDW3 register is loaded into CMPD_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_XMINMAX_SHDW3" acronym="CONTROLSS_G1_EPWM9_XMINMAX_SHDW3" offset="0x7C4" width="32" description="XMINMAX Shadow 3 Register">
		<bitfield id="XMIN_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="The value in the XMIN_SHDW3 register is loaded into XMIN_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XMAX_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="The value in the XMAX_SHDW3 register is loaded into XMAX_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_DECTL" acronym="CONTROLSS_G1_EPWM9_DECTL" offset="0x800" width="32" description="DE control register">
		<bitfield id="REENTRYDLY" width="8" begin="15" end="8" resetval="0x0" description="Determines the blocking window after DEACTIVE flag is cleared in which setting of DEACTIVE flag is prevented from being set. 0 : No blocking 1 : Blocked until 1 PWMSYNCOUT event 2 : Blocked until 2 PWMSYNCOUT events . . 255 : Blocked until 127 PWMSYNCOUT events" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="MODE" width="1" begin="1" end="1" resetval="0x0" description="0 : DEACTIVE flag works in cycle by cycle mode. On every PWMSYNCOUT, set condition of DEACTIVE flag is evaluated. If the set condition is not present the flag is cleared. 1 : DEACTIVE flag works in one shot mode [hardware set] and software clear." range="1" rwaccess="R/W"/> 
		<bitfield id="ENABLE" width="1" begin="0" end="0" resetval="0x0" description="DE function enable 0 : Diode Emulation mode functionality is disabled. DEACTIVE flag is not set on a TRIPH_OR_TRIPL event. 1 : Diode Emulation mode functionality is enabled. DEACTIVE flag is set on a TRIPH_OR_TRIPL event.  Note: ENABLE bit is cleared on a PWMTRIP event. Software has to re-enable this bit after PWMTRIP condition is serviced." range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_DECOMPSEL" acronym="CONTROLSS_G1_EPWM9_DECOMPSEL" offset="0x804" width="32" description="Used to configure the comparator whose trip sources will be used.">
		<bitfield id="TRIPH" width="6" begin="21" end="16" resetval="0x0" description="000000 : Reserved 000001 : Input-XBAR[0] is the source of TRIPH 000010 : Input-XBAR[1] is the source of TRIPH . . 100000 : Input-XBAR[31] is the source of TRIPH 100001 : CMPSSA0 is the source of TRIPH 100010 : CMPSSA1 is the source of TRIPH . . 101010 : CMPSSA9 is the source of TRIPH 101011 : Reserved . . 110000 : Reserved 110001 : CMPSSB0 is the source of TRIPH 110010 : CMPSSB1 is the source of TRIPH . . 111010 : CMPSSB9 is the source of TRIPH 111011 : Reserved . . 111111 : Reserved Note: All the reserved encodings result in TRIPH being 0." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="TRIPL" width="6" begin="5" end="0" resetval="0x0" description="000000 : Reserved 000001 : Input-XBAR[0] is the source of TRIPL 000010 : Input-XBAR[1] is the source of TRIPL . . 100000 : Input-XBAR[31] is the source of TRIPL 100001 : CMPSSA0 is the source of TRIPL 100010 : CMPSSA1 is the source of TRIPL . . 101010 : CMPSSA9 is the source of TRIPL 101011 : Reserved . . 110000 : Reserved 110001 : CMPSSB0 is the source of TRIPL 110010 : CMPSSB1 is the source of TRIPL . . 111010 : CMPSSB9 is the source of TRIPL 111011 : Reserved . . 111111 : Reserved Note: All the reserved encodings result in TRIPL being 0." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_DEACTCTL" acronym="CONTROLSS_G1_EPWM9_DEACTCTL" offset="0x808" width="32" description="Used to configure the PWM controls when in DE mode.">
		<bitfield id="TRIPENABLE" width="1" begin="16" end="16" resetval="0x0" description="0 : PWMTRIP does not bypass the diode emulation logic. 1 : PWMTRIP bypasses the diode emulation PWM generation logic [not complete bypass of module]" range="16" rwaccess="R/W"/> 
		<bitfield id="TRIPSELB" width="1" begin="6" end="6" resetval="0x0" description="0 : TRIPH 1 : TRIPL" range="6" rwaccess="R/W"/> 
		<bitfield id="PWMB" width="2" begin="5" end="4" resetval="0x0" description="00 : synchronized version of TRIPH or TRIPL signal as selected by the TRIPSELB 01 : synchronized and inverted version of TRIPH or TRIPL signal as selected by the TRIPSELB 10 : A constant 0 drives PWMB when DEACTIVE flag is set. 11 : A constant 1 drives PWMB when DEACTIVE flag is set." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="TRIPSELA" width="1" begin="2" end="2" resetval="0x0" description="0 : TRIPH 1 : TRIPL" range="2" rwaccess="R/W"/> 
		<bitfield id="PWMA" width="2" begin="1" end="0" resetval="0x0" description="00 : synchronized version of TRIPH or TRIPL signal as selected by the TRIPSELA 01 : synchronized and inverted version of TRIPH or TRIPL signal as selected by the TRIPSELA 10 : A constant 0 drives PWMA when DEACTIVE flag is set. 11 : A constant 1 drives PWMA when DEACTIVE flag is set." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_DESTS" acronym="CONTROLSS_G1_EPWM9_DESTS" offset="0x80C" width="32" description="DE Status register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : Diode emulation mode is not active 1 : Diode emulation mode is active" range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_DEFRC" acronym="CONTROLSS_G1_EPWM9_DEFRC" offset="0x810" width="32" description="DE Status force register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : No effect. 1 : Forces DEACTIVE flag to 1." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_DECLR" acronym="CONTROLSS_G1_EPWM9_DECLR" offset="0x814" width="32" description="DE Status clear register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : No effect. 1 : Clears DEACTIVE flag." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_DEMONCNT" acronym="CONTROLSS_G1_EPWM9_DEMONCNT" offset="0x820" width="32" description="DE trip monitor counter">
		<bitfield id="CNT" width="16" begin="15" end="0" resetval="0x0" description="An 16-bit counter which monitors the frequency of diode mode trip events. When TripHorTripL is active:    Increment CNT [increment INCSTEP on every EPWMxSYNC] When TripHorTripL is in-active: Decrement CNT [decrement DECSTEP on every EPWMxSYNC] If[ CNT > THRESHOLD] then generate DETRIP and clear the counter. If[ [CNT - DECSTEP] &#38;#60; 0] then CNT = 0 If[ [CNT + INCSTEP] >= 0xFFFF] then CNT = 0xFFFF  Note : CNT is cleared when DECTL.ENABLE is 0 Note: DEMONTHRES == 0x0 should not generate trip as the DEMONTHRES and DEMONCNT registers have reset value of 0x0" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_DEMONCTL" acronym="CONTROLSS_G1_EPWM9_DEMONCTL" offset="0x824" width="32" description="DE monitor mode control">
		<bitfield id="ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Enable bit for DE Mode Monitor counter function. 0: DE Mode Monitor counter function is disabled 1: DE Mode Monitor counter function is enabled" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_DEMONSTEP" acronym="CONTROLSS_G1_EPWM9_DEMONSTEP" offset="0x828" width="32" description="DE monitor counter step">
		<bitfield id="DECSTEP" width="8" begin="23" end="16" resetval="0x0" description="Defines the decrement step of DEMONCNT.CNT counter." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="INCSTEP" width="8" begin="7" end="0" resetval="0x0" description="Defines the increment step of DEMONCNT.CNT counter." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_DEMONTHRES" acronym="CONTROLSS_G1_EPWM9_DEMONTHRES" offset="0x82C" width="32" description="DE monitor counter threshold">
		<bitfield id="THRESHOLD" width="16" begin="15" end="0" resetval="0x0" description="Defines the threshold of DE monitor counter. " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM9_MINDBCFG" acronym="CONTROLSS_G1_EPWM9_MINDBCFG" offset="0xC00" width="32" description="Minimum dead band configuration register.">
		<bitfield id="POLSELB" width="1" begin="24" end="24" resetval="0x0" description="Select signal for the AND OR logic of BLOCKB [output of SELBLOCKB mux] and PWMB signals 0 : Select BLOCKB is inverted and ANDed with PWMB. 1 : Select BLOCKB is Ored with PWMB." range="24" rwaccess="R/W"/> 
		<bitfield id="SELB" width="4" begin="23" end="20" resetval="0x0" description="PWMB min dead band reference 0x0 : DEPWMB  0x1 : Output 1 from PWM output XBAR 0x2 : Output 2 from PWM output XBAR . . 0xf : Output 15 from PWM output XBAR" range="23 - 20" rwaccess="R/W"/> 
		<bitfield id="SELBLOCKB" width="1" begin="19" end="19" resetval="0x0" description="0 : Select BLOCKB as the blocking signal on PWMB. 1 : Select BLOCKA as the blocking signal on PWMB." range="19" rwaccess="R/W"/> 
		<bitfield id="INVERTB" width="1" begin="18" end="18" resetval="0x0" description="0 : No inversion on the selected reference signal which is used in the min deadband logic on PWMB. 1 : Invert the selected reference signal which is used in the min deadband logic on PWMB." range="18" rwaccess="R/W"/> 
		<bitfield id="ENABLEB" width="1" begin="16" end="16" resetval="0x0" description="0 : Minimum dead band logic is disabled 1 : Minimum dead band logic is enabled " range="16" rwaccess="R/W"/> 
		<bitfield id="POLSELA" width="1" begin="8" end="8" resetval="0x0" description="Select signal for the AND OR logic of BLOCKA [output of SELBLOCKA mux] and PWMA signals 0 : Select BLOCKA is inverted and ANDed with PWMA. 1 : Select BLOCKA is Ored with PWMA." range="8" rwaccess="R/W"/> 
		<bitfield id="SELA" width="4" begin="7" end="4" resetval="0x0" description="PWMA min dead band reference 0x0 : DEPWMA  0x1 : Output 1 from PWM output XBAR 0x2 : Output 2 from PWM output XBAR . . 0xf : Output 15 from PWM output XBAR" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="SELBLOCKA" width="1" begin="3" end="3" resetval="0x0" description="0 : Select BLOCKA as the blocking signal on PWMA. 1 : Select BLOCKB as the blocking signal on PWMB." range="3" rwaccess="R/W"/> 
		<bitfield id="INVERTA" width="1" begin="2" end="2" resetval="0x0" description="0 : No inversion on the selected reference signal which is used in the min deadband logic on PWMA. 1 : Invert the selected reference signal which is used in the min deadband logic on PWMA." range="2" rwaccess="R/W"/> 
		<bitfield id="ENABLEA" width="1" begin="0" end="0" resetval="0x0" description="0 : Minimum dead band logic is disabled 1 : Minimum dead band logic is enabled " range="0" rwaccess="R/W"/>
	</register>
